package com.eomcs.basic.practice05;

public class practice26 {

  public static void main(String[] args) {
    
    System.out.println(3 << 1);
    //  [00000000_00000000_00000000_00000011] => 3
    // 0[00000000_00000000_00000000_00000110] => 비트 이동 후 : 6
    
    System.out.println(3 << 33);
    System.out.println(3 << 65);
    System.out.println(3 << 97);
    
    // int 타입 값을 비트 이동할 때에는 이동 값이 0 ~ 31까지만 유효하다.
    // 초과하는 값으로 비트 이동을 할 경우에는 32로 나눈 나머지 값으로 비트이동한다.
    // ex) 33을 비트이동 => 33 % 32 = 1 ===> 3 << 1
    // 식 : 이동하려는 비트 값 % 해당 데이터타입의 비트 개수 
    
    // 비트 연산자로도 나머지 값을 구할 수 있다.
    // 식 : (이동하려는 비트 값) & (이동하려는 비트 값 - 1)
    // 33 & (33 - 1) = 33 & 32
    //   00100001 (33)
    // & 00011111 (32)
    // ------------------
    //   00000001 (1)
    
    
  }
}
