package com.eomcs.basic.practice05;

public class practice10 {
  
  public static void main (String[] args) {
    
    byte b;
    
    // b = 128; => 컴파일 오류 
    // 기본적으로 리터럴은 기본 단위 4바이트이기 때문에 그보다 낮은 byte나 short, char등에 저장되지 않는다.
    // 그러나 리터럴의 경우 4바이트라도 그 값의 범위가 해당 데이터 타입 범위 안에 속하면 예외적으로
    // 저장이 가능하다.
    // 만약 범위를 벗어나는 값을 저장하고 싶다면 명시적 형변환을 통해 임시적으로 데이터 타입을
    // 변환시켜주어야 한다.
    
    b = (byte)256;
    // 위와 같이 명시적 형변환을 통해 억지로 저장할 수 있다.
    // 그러나 값의 범위가 메모리를 초과하면 초과한 부분만큼 값이 버려지게 된다.
    // int : 0000 0000 0000 0000 0000 0001 0000 0000
    // byte :                              0000 0000
    // ---------------------------------------------
    // 4바이트를 강제로 1바이트로 줄이기 때문에 256 부분인 1이 버려지게 된다.
    
    System.out.println(b);
    // 때문에 출력값은 0이 된다.
    
  }

}
