package com.eomcs.basic.practice05;

public class practice32 {

  public static void main (String[] args) {
    
    boolean c, cpp, java, js, python, php, html, css;
    
    c = true;
    cpp = false;
    java = true;
    js = false;
    python = true;
    php = false;
    html = true;
    css = false;
    
    // 각각의 상태를 변수 선언하여 저장
    // 32바이트 소요
    
    boolean[] lang = new boolean[8];
    lang[0] = true;
    lang[1] = false;
    lang[2] = true;
    lang[3] = false;
    lang[4] = true;
    lang[5] = false;
    lang[6] = true;
    lang[7] = false;
    
    // 배열 이용하여 생성 가능
    // 8바이트 소요
    
    
    // 비트 연산자를 이용하면 최대 32개의 데이터 저장 가능
    // 최소 단위는 4바이트(32비트)이므로 8비트만 사용한다 가정할 
    // 00000000
    // ||||||||- css
    // |||||||- html
    // ||||||- php
    // |||||- python
    // ||||- javascript
    // |||- java
    // ||- c++
    // |- c
    // 로 가정한다.
    
    int lang2 = 0;
        
    lang2 |= 0x80;
    // C를 true값으로 만든다.
    // 0000 0000 0000 0000 0000 0000 0000 0000 = lang2
    // 0000 0000 0000 0000 0000 0000 1000 0000 = 0x80
    // -----------------------------------------------
    // 0000 0000 0000 0000 0000 0000 1000 0000
    // lang2 = 1000 0000
    
    lang2 |= 0x20;
    // 0000 0000 0000 0000 0000 0000 1000 0000 = lang2
    // 0000 0000 0000 0000 0000 0000 0010 0000 = 0x20
    // ------------------------------------------------
    // 0000 0000 0000 0000 0000 0000 1010 0000
    // lang2 = 1010 0000
    
    lang2 |= 0x08;
    // 0000 0000 0000 0000 0000 0000 1010 0000 = lang2
    // 0000 0000 0000 0000 0000 0000 0000 1000 = 0x08
    // ------------------------------------------------
    // 0000 0000 0000 0000 0000 0000 1010 1000 
    // lang2 = 1010 1000
    
    lang2 |= 0x02;
    // 0000 0000 0000 0000 0000 0000 1010 1000 = lang2
    // 0000 0000 0000 0000 0000 0000 0000 0010 = 0x02
    // --------------------------------------------------
    // 0000 0000 0000 0000 0000 0000 1010 1010 
    // lang2 = 1010 1010
    
    System.out.println(Integer.toBinaryString(lang2));
    // C++, js, php, css는 0x00을 OR 연산함으로 false값이 되도록 출력하였다.0
    }
}
